<template>
  <Modal :show="true" :closeable="true" @close="$emit('close')">
    <div class="p-6 space-y-4 max-h-[70vh] overflow-y-auto text-left">
      <h2 class="text-lg font-bold text-gray-800 text-center">Политика за приватност</h2>

      <p class="text-sm text-gray-700 leading-relaxed">
        Политика за приватност и известување за заштита на податоци
      </p>

      <p class="text-sm text-gray-700 leading-relaxed">
        (Последно ажурирано: 07.11.2025)
      </p>

      <h1 class="text-bold text-xl">
        1. Вовед
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Оваа Политика за приватност објаснува како веб страната Нулта корупција
        („ние“, „наш“ или „нас“), изработена како активност од проектот „Под маса:
        Претпродажба на интегритетот“ собира, обработува, складира и објавува
        информации поврзани со искуствата на граѓаните со корупцијата. Проектот е
        финансиран од Европската Унија и работи во целосна согласност со Општата
        регулатива за заштита на податоците (ЕУ) 2016/679 (GDPR) и релевантните
        национални закони за заштита на податоците.
        Нашата цел е да користиме анонимизирани и агрегирани податоци за поддршка
        на иницијативите за застапување, подигање на свеста и борба против
        корупцијата , а воедно да обезбедиме целосно почитување на
        индивидуалните права за приватност и заштита на податоците .
      </p>

      <h1 class="text-bold text-xl">
        2. Контролор на податоци
      </h1>


      <p class="text-sm text-gray-700 leading-relaxed">
        Контролорот на податоци одговорен за обработка на вашите информации е:
        Центар за едукација, култура и активизам Мултус
        Адреса: ул. Гоце Делчев 52, Гевгелија
        е-пошта: multusmk@gmail.com
        Доколку имате какви било прашања во врска со оваа Политика за приватност или
        како ги обработуваме вашите лични податоци, ве молиме контактирајте не на
        горенаведената е-адреса.
      </p>

      <h1 class="text-bold text-xl">
        3. Кои податоци ги собираме
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Преку нашиот процес на анкетирање и собирање приказни, може да ги собереме
        следниве информации:
        - Возрасен интервал (на пр., 18–24, 25–34, 35–44, итн.)
        - Пол
        - Локација на инцидентот со поткуп или корупција (не локацијата на
        испитаникот)
        - Вид на вклучена институција или услуга ( не директно лице)

        - Наратив/приказна за искуството (доколку е дадена согласност за
        објавување)
        - Преференции за согласност (за објавување или внатрешно складирање)
        Ние не собираме :
        - Имиња, контакт информации, IP адреси или какви било лични податоци што
        директно ве идентификуваат.
        - Геолокација или метаподатоци што индиректно би можеле да
        идентификуваат поединец.
        Сите информации се собираат анонимно и се чуваат на начин што спречува
        повторна идентификација.
      </p>

      <h1 class="text-bold text-xl">
        4. Правна основа за обработка
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Нашите активности за обработка се засноваат на следните законски основи
        согласно GDPR:
        - Член 6(1)(a) – Согласност:
        Ние обработуваме и објавуваме информации само кога испитаникот дава
        експлицитна согласност.
        - Член 6(1)(e) – Јавен интерес:
        Податоците што се користат во анонимизирана и агрегирана форма ја
        поддржуваат јавната свест и застапувањето за прашања поврзани со
        корупцијата, што се смета за прашање од суштински јавен интерес.
      </p>

      <h1 class="text-bold text-xl">
        5. Цел на собирањето податоци
      </h1>
      <p class="text-sm text-gray-700 leading-relaxed">
        Собраните информации се користат за следните цели:
        - Да се визуелизираат и анализираат шемите на корупција на анонимен
        начин, со цел да се изложат жариштата на корупција во јавните сектори, а
        не оние кои биле изложени на нив.
        - Јавно споделување на агрегирани податоци за застапување, подигање на
        свеста и истражувачки цели .
        - Да се поддржат истражувања и иницијативи насочени кон намалување и
        спречување на корупцијата.

        Никакви индивидуални податоци нема да се користат за комерцијални цели или
        профилирање.
      </p>

      <h1 class="text-bold text-xl">
        6. Анонимизација и минимизирање на податоци
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Применуваме строги процедури за анонимизација и псевдонимизација:
        - Податоците се собираат во неидентификувани категории (возрасен опсег, а
        не специфична возраст).
        - Географските податоци се однесуваат само на локацијата на инцидентот ,
        а не на лицето.
        - Приказните се прегледуваат и уредуваат за да се отстранат сите лични
        идентификатори пред објавувањето.
        - Доколку испитаникот не се согласи за објавување, неговата приказна се
        чува интерно во анонимизирана форма и никогаш нема да се објави
        јавно .
        Собираме само минималните информации потребни за целта на нашиот
        проект.
      </p>

      <h1 class="text-bold text-xl">
        7. Складирање и безбедност на податоци
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Сите податоци се чуваат безбедно на сервери лоцирани во Европската Унија
        (или кај добавувачи кои нудат заштитни мерки во согласност со GDPR, како што е
        Рамката за приватност на податоци помеѓу ЕУ и САД, доколку е применливо).
        Спроведуваме соодветни технички и организациски мерки за заштита на
        податоците, вклучувајќи:
        - Шифриран пренос (HTTPS)
        - Безбедно складирање на серверот
        - Пристапот е ограничен само на овластен персонал на проектот
        - Редовни прегледи на заштитата на податоците
        Внатрешните податоци што се користат за анализа и истражување се чуваат
        одвоено од анонимизираните јавни податоци прикажани на интерактивната мапа.
      </p>

      <h1 class="text-bold text-xl">
        8. Објавување на приказни и податоци
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Информациите се појавуваат на јавната мапа само со изречна согласност од
        учесникот .
        Доколку не е дадена согласност:
        - Приказната останува интерно складирана само за агрегатна,
        анонимизирана анализа.
        - Не се објавуваат никакви информации што можат да се идентификуваат или
        наративни.
        Објавените стории се прикажуваат без лични идентификатори , точни локации
        или какви било елементи што би можеле да доведат до повторна идентификација.
      </p>


      <h1 class="text-bold text-xl">
        9. Период на задржување
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Анонимизираните податоци и податоците базирани на согласност може да се
        чуваат до 5 години за истражувачки и застапнички цели, освен ако не е поинаку
        предвидено со правилата за финансирање на ЕУ или до крајот на проектот.
        Учесниците можат да ја повлечат својата согласност во секое време , по што
        нивната приказна ќе биде отстранета од јавната мапа и од интерната употреба.
      </p>

      <h1 class="text-bold text-xl">
        10. Вашите права според GDPR
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Ги имате следните права во врска со вашите податоци:
        - Право да се повлече согласноста во секое време.
        - Право на пристап до информации за обработката на вашите податоци.
        - Право да побарате бришење на вашите доставени информации.
        - Право на ограничување на обработката во одредени случаи.
        Бидејќи нашето собирање податоци е анонимно, можеби нема да можеме да
        идентификуваме или отстраниме одреден запис ако не може да се поврзе со
        поединечен испитаник. Во такви случаи, ова ќе го објасниме транспарентно.
        За да ги остварите вашите права, контактирајте не на multusmk@gmail.com
      </p>


      <h1 class="text-bold text-xl">
        11. Споделување податоци и трети страни
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Ние не продаваме, изнајмуваме или споделуваме податоци со комерцијални
        субјекти.

        Информациите може да се споделуваат само:
        - Во агрегирана, анонимизирана форма за застапување или истражување.
        - Со институции на ЕУ или донатори на проекти за известување и
        транспарентност, согласно усогласеноста со GDPR.
      </p>


      <h1 class="text-bold text-xl">
        12. Промени во оваа политика
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        Може да ја ажурираме оваа Политика за приватност за да ги одрази промените во
        нашите практики или законски обврски.
        Најновата верзија секогаш ќе биде достапна на: https://zero-
        coruption.onrender.com/map
      </p>

      <h1 class="text-bold text-xl">
        13. Контакт
      </h1>

      <p class="text-sm text-gray-700 leading-relaxed">
        За прашања во врска со оваа политика или вашите права, ве молиме
        контактирајте го нашиот тим за заштита на податоци на:
        <br>
        📧 multusmk@gmail.com
        <br>
        📌 Гоце Делчев 52, Гевгелија , Северна Македонија
      </p>

      <div class="flex justify-center mt-6">
        <button class="px-4 py-2 rounded bg-yellow-500 text-black text-sm font-medium hover:bg-yellow-400"
          @click="$emit('close')">
          Затвори
        </button>
      </div>
    </div>
  </Modal>
</template>

<script setup>
import Modal from '@/Components/Modal.vue'

// Declare the event
defineEmits(['close'])
</script>
